const String serverProtocal = '''
生效时间：2023年 02  月 01   日

一. 前言
 

《八观认知评估系统App用户服务协议》（以下简称“本协议”）是您与无疆就您注册、登录、使用（以下统称“使用”） 八观认知评估系统App，并获得 八观认知评估系统App提供的相关产品或服务所订立的协议。
 
为了更好地为您提供服务，请您在开始使用八观认知评估系统App产品或服务之前，认真阅读并充分理解本协议，特别是涉及免除或者限制责任的条款、权利许可和信息使用的条款、法律适用和争议解决条款等。其中，免除或者限制责任条款等重要内容将以加粗形式提示您注意，您应重点阅读。
 
如您不同意本协议，这将导致无疆无法为您提供完整的产品和服务，您也可以选择停止使用。如您自主选择同意或使用八观认知评估系统App产品或服务，则视为您已充分理解本协议，并同意作为本协议的一方当事人接受本协议以及其他与八观认知评估系统App产品或服务相关的协议和规则（包括但不限于《八观认知评估系统App个人信息保护政策》）的约束。
 
在八观认知评估系统App运营过程中，无疆有权决定，安排或指定第三方继续运营八观认知评估系统App。并且，就本协议项下涉及的某些服务，可能会由无疆的关联方、继承无疆的实体向您提供。您知晓并同意接受相关服务内容，即视为接受相关权利义务关系亦受本协议约束。
 
 
二. 定义
 
1. 用户：指 八观认知评估系统App的注册用户，在本协议中被称为“您”或“用户”。
 
2. 本协议：包括《八观认知评估系统App用户服务协议》、《八观认知评估系统App个人信息保护政策》及所有无疆已经发布或将来可能发布的各类规则、规范、通知、公告等（以下合称“规则”）。
 
3.   八观认知评估系统App：指北京无疆脑智科技有限公司开发、运营的App。
 
4. 八观认知评估系统App产品或服务：指北京无疆脑智科技有限公司通过 八观认知评估系统App向您提供的产品或服务，主要包括用户认知测评任务与导出用户报告等。 
 
 
三.  产品及相关服务
 
 1. 您可以通过访问八观认知评估系统App使用相关产品或服务。若您并非从无疆获取八观认知评估系统App的，无疆无法保证非官方版本的八观认知评估系统App能够正常使用，您因此遭受的损失与无疆、无疆关联方、继承无疆的实体无关。

2. 您理解，您使用八观认知评估系统App产品或服务需自行准备与软件及相关服务有关的终端设备（如电脑、Pad等装置），一旦您在您终端设备中打开八观认知评估系统App，即视为您使用八观认知评估系统App产品或服务。为充分实现“无疆”的全部功能，您可能需要将您的终端设备联网，您理解您应自行承担所需要的费用（如流量费、上网费等）。
 
3. 无疆可能根据实际需要对部分产品或服务收取费用，对收费服务的收费标准、方式进行修改和变更。前述修改、变更或开始收费前，无疆将在相应服务页面进行通知或公告。如果您不同意上述修改、变更或付费内容，则应停止使用该服务。
 
4. 您在接受相关产品或服务时，应按照 八观认知评估系统App的要求提供相关信息或数据，并保证所提供的信息或数据的完整性、真实性、来源合法合规性和准确性。
 
5. 为更好的提升用户体验及服务，无疆将不定期提供 八观认知评估系统App产品或服务的更新或改变（包括但不限于网站升级、软件修改、升级、功能强化、开发新服务、软件替换等），您可根据需要自行选择是否更新相应的版本。
 
 
四. 关于“帐号”
 
1. 八观认知评估系统App产品或服务为您提供了注册通道，您有权以手机号码授权等方式（具体以注册页面展示为准）注册/登录的方式，您的手机号码是用以登录并以注册用户身份使用八观认知评估系统App产品或服务的凭证。
 
2. 您理解并承诺，您所设置的帐号不得违反国家法律法规及“无疆”的相关规则，您的帐号名称、头像和简介等注册信息及其他个人信息中不得出现违法和不良信息，未经他人许可不得用他人名义（包括但不限于冒用他人姓名、手机号码等或采取其他足以让人引起混淆的方式）开设帐号。您在帐号注册及使用过程中需遵守相关法律法规，不得实施任何侵害国家利益、损害其他公民合法权益，有害公序良俗的行为。无疆有权对您提交的注册信息进行审核。
 
4. 您在“无疆”中的注册帐号仅限于您使用，未经无疆书面同意，禁止以任何形式赠与、借用、出租、转让、售卖或以其他方式许可他人使用该帐号。如果无疆发现或者有合理理由认为使用者并非帐号初始注册人，为保障帐号安全，无疆有权立即暂停或终止向该注册帐号提供服务，并有权永久禁用该帐号。
 
5. 您有责任维护您的无疆个人帐号的安全性与保密性，并对您以注册帐号名义所从事的活动承担全部法律责任，包括但不限于您在本产品及相关服务上进行的任何数据修改、款项支付等操作行为可能引起的一切法律责任。您应高度重视对帐号与密码的保密，在任何情况下不向他人透露帐号及密码。若发现他人未经许可使用您的帐号或发生其他任何安全漏洞问题时，您应当立即通知无疆。
 
6. 如您无法访问您的帐号，可及时向无疆申诉请求找回帐号。您理解并认可，账号找回机制仅需要识别申诉单上所填资料与系统记录资料具有一致性，而无法识别申诉人是否系帐号真正有权使用者。无疆特别提醒您应妥善保管您的无疆个人帐号。当您使用完毕后，应安全退出。因您保管不当等自身原因或其他不可抗力因素导致遭受盗号或无法访问帐号，您应自行承担相应责任。
 
7. 在注册、使用和管理帐号时，您应保证注册帐号时填写的身份信息的真实性，请您在注册、管理帐号时使用真实、准确、合法、有效的相关身份证明材料及必要信息（包括您的姓名、联系电话等）。若您提交的材料或提供的信息不准确、不真实、不规范、不合法或者无疆有理由怀疑为错误、不实或不合法的资料，则无疆有权拒绝为您提供相关服务，您可能无法使用八观认知评估系统App产品或服务或在使用过程中部分功能受到限制。
 
8. 当您完成“无疆”的帐号注册、登录并进行合理和必要的身份验证后，您可随时浏览、修改自己提交的个人身份信息。您理解并同意，出于安全性和身份识别（如帐号或密码找回申诉服务等）的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。您也可以申请注销帐号，无疆会在完成个人身份、安全状态、设备信息、侵权投诉等方面的合理和必要的验证后协助您注销帐号，并依照您的要求删除有关您帐号的一切信息，法律法规另有规定的除外。
 
五. 用户个人信息保护
 
1. 无疆与您一同致力于您（即能够独立或与其他信息结合后识别您身份的信息）的保护。
 
2. 保护用户个人信息是无疆的基本原则之一，在使用八观认知评估系统App产品或服务的过程中，您可能需要提供您的个人信息，以便无疆向您提供更好的服务和相应的技术支持。无疆将依法保护您浏览、修改、删除相关个人信息以及撤回授权的权利，并将运用加密技术、匿名化处理等其他与 八观认知评估系统App产品或服务相匹配的技术措施及其他安全措施保护您的个人信息。
 
3. 更多关于您个人信息保护的内容，请参看《八观认知评估系统App个人信息保护政策》。
 
六. 用户行为规范
 
您应对您使用 八观认知评估系统App产品或服务的行为负责，除非法律允许或者经无疆事先书面许可，您使用八观认知评估系统App产品或服务应遵守下述约定：
 
1. 您保证您在无疆平台上提供的信息的真实性、合法性和有效性。您单独承担在无疆平台上发布内容（如有）的一切相关责任。您使用或提供的服务应遵守所有适用于无疆的法律法规等规定。
 
2. 您不得使用本服务于其他非法用途。
 
3. 您不得利用或针对 八观认知评估系统App产品或服务进行任何危害计算机网络安全的行为，包括但不限于：
 
（1）使用未经无疆授权或许可的任何插件、外挂、系统或第三方工具对 八观认知评估系统App产品或服务的正常运行进行干扰、破坏、修改或施加其他影响。
（2）非法侵入网络、干扰网络正常功能、窃取网络数据等危害网络安全的活动；
（3）使用未经许可的数据或进入未经许可的服务器/帐号；
（4）未经允许进入公众计算机网络或者他人计算机系统并删除、修改、增加存储信息；
（5）未经许可，企图探查、扫描、测试“无疆”系统或网络的弱点或其它实施破坏网络安全的行为；
（6）企图干涉、破坏“无疆”系统或网站的正常运行，故意传播恶意程序或病毒以及其他破坏干扰正常网络信息服务的行为；
（7）伪造TCP/IP数据包名称或部分名称；
（8）对 八观认知评估系统App产品或服务进行反向工程、反向汇编、编译或者以其他方式尝试发现 八观认知评估系统App产品或服务的源代码。
 
4. 您保证不实施任何违反法律法规、本协议、无疆的相关规则及侵犯他人合法权益的其他行为。
 
如果无疆有理由认为您的行为违反或可能违反上述约定的，无疆可独立进行判断并处理，且在任何时候有权在不事先通知的情况下终止向您提供服务，并依法追究相关责任。
 
 
七. 法律责任
 
1. 您同意承担违反相关法律法规或违反平台规则情形造成的全部责任。
 
2. 针对您违反本协议或其他服务条款的行为，无疆有权独立判断视情况采取限制帐号部分或者全部功能直至终止提供服务、永久关闭帐号等措施，对于因此而造成您无法正常使用帐号及相关服务、无法正常获取您帐号内资产或其他权益等后果，无疆不承担任何责任。
 
3. 因您违反本协议或其他服务条款规定，引起第三方投诉或诉讼索赔的，您应当自行处理并承担可能因此产生的全部法律责任。因您的违法或违约等行为导致无疆及其关联方、继承无疆的实体向任何第三方赔偿或遭受国家机关处罚的，您还应足额赔偿无疆及其关联方、继承无疆的实体因此遭受的全部损失。
 
4. 无疆尊重并保护用户及他人的知识产权、名誉权、姓名权、隐私权、个人信息等合法权益。您保证，在使用 八观认知评估系统App产品或服务时上传（如有）的文字、图片、视频、音频、链接等不侵犯任何第三方的知识产权、名誉权、姓名权、隐私权、个人信息等权利及合法权益。否则，无疆有权在收到权利方或者相关方通知的情况下移除该涉嫌侵权内容。针对第三方提出的全部权利主张，您应自行处理并承担可能因此产生的全部法律责任。
 
 
 
八. 服务的变更、中断和终止
 
1. 您理解并同意，无疆提供的 八观认知评估系统App产品或服务是按照现有技术和条件所能达到的现状提供的。无疆会尽最大努力向您提供服务，确保服务的连贯性和安全性。您理解，无疆不能随时或始终预见和防范法律、技术以及其他风险，包括但不限于不可抗力、网络原因、第三方服务瑕疵、第三方网站等原因可能导致的服务中断、不能正常使用 E八观认知评估系统App产品或服务以及其他的损失和风险。
 
2. 您理解并同意，无疆为了整体服务运营、平台运营安全的需要，有权视具体情况决定服务/功能的设置及其范围修改、中断、中止或终止八观认知评估系统App产品或服务。


九. 广告
 
1. 您理解并同意，在您使用 八观认知评估系统App产品或服务过程中，无疆可能会向您推送具有相关性的信息、广告发布或品牌推广服务，且无疆将在八观认知评估系统App产品或服务中展示 八观认知评估系统App产品或服务和/或第三方供应商、合作伙伴的商业广告、推广或信息（包括商业或非商业信息）。
 
2. 如您不愿意接收具有相关性的广告，您有权拒绝该广告信息的推送，该广告同类广告的推送将会减少。
 
3. 如您不愿意接收八观认知评估系统App推送通知服务的，您有权在手机系统通知管理中自行关闭该服务。
 
4. 无疆依照法律规定履行广告及推广相关义务，您应当自行判断该广告或推广信息的真实性和可靠性并为自己的判断行为负责。除法律法规明确规定外，您因该广告或推广信息进行的购买、交易或因前述内容遭受的损害或损失，您应自行承担，无疆不予承担责任。
 
 
十. 知识产权
 
1. 无疆在 八观认知评估系统App产品或服务中提供的内容（包括但不限于软件、技术、程序、网页、文字、图片、图像、音频、视频、图表、版面设计、电子文档等）的知识产权属于无疆、无疆关联方所有（八观认知评估系统App的页面、其他协议中对特定内容注明权利人的除外）。未经无疆许可，任何人不得擅自使用（包括但不限于通过任何机器人、“蜘蛛”等程序或设备监视、复制、传播、展示、镜像、上载、下载） 八观认知评估系统App产品或服务中的内容。
 
2. 无疆为八观认知评估系统App开发、运营提供技术支持，并对 八观认知评估系统App产品或服务的开发和运营等过程中产生的所有数据和信息等享有法律法规允许范围内的全部权利。 
 
 
十一. 免责声明
 
1. 您理解并同意， 八观认知评估系统App产品或服务可能会受多种因素的影响或干扰，无疆不保证(包括但不限于)：
 
（1） 八观认知评估系统App或服务不受干扰，及时、安全、可靠或不出现错误；用户经由无疆取得的任何软件、服务或其他材料符合用户的期望；
（2） 八观认知评估系统App产品或服务中任何错误都将能得到更正。
 
2. 您理解并同意，无疆平台服务是按照现有技术和条件所能达到的水平提供的服务。无疆会尽最大努力为您提供服务，确保服务的连贯性和安全性。在使用 八观认知评估系统App产品或服务过程中，可能遇到不可抗力等因素（不可抗力是指不能预见、不能克服并不能避免的客观事件），包括但不限于政府行为、自然灾害（如洪水、地震、台风等）、网络原因、战争、罢工、骚乱等。出现不可抗力情况时，无疆将努力在第一时间及时修复，但因不可抗力造成的暂停、中止、终止服务或造成的任何损失，无疆在法律法规允许范围内免于承担责任。
 
3. 您理解并同意，本协议旨在保障遵守国家法律法规、维护公序良俗，保护用户和他人合法权益，无疆在能力范围内尽最大的努力按照相关法律法规进行判断，但并不保证无疆判断完全与司法机关、行政机关的判断一致，如因此产生的后果您已经理解并同意自行承担。
 
4. 在任何情况下，无疆均不对任何间接性、后果性、惩罚性、偶然性、特殊性或刑罚性的损害，包括因您使用 八观认知评估系统App产品或服务而遭受的利润损失，承担责任。除法律法规另有明确规定外，无疆对您承担的全部责任，无论因何原因或何种行为方式，始终不超过您因使用 八观认知评估系统App产品或服务期间而支付给无疆的费用（如有）。
 
  
十二. 关于单项服务与第三方服务的特殊约定
 
1. 八观认知评估系统App产品或服务中可能包含无疆以各种合法方式获取的信息或信息内容链接，同时也包括无疆合法运营的其他单项服务。这些服务在“无疆”可能以单独板块形式存在。无疆有权不时地增加、减少或改动这些特别板块的设置及服务。
 
2. 您可以在八观认知评估系统App中开启和使用上述单项服务功能。某些单项服务可能需要您同时接受就该服务特别制订的协议或者其他约束您与该项服务提供者之间的规则。必要时无疆将以醒目的方式提供这些协议、规则供您查阅。一旦您开始使用上述服务，则视为您理解并接受有关单项服务的相关协议、规则的约束。如未标明使用期限、或未标明使用期限为“永久”、“无限期”或“无限制”的，则这些服务的使用期限为自您开始使用该服务至该服务在八观认知评估系统App停止提供之日为止。
 
3. 您在 八观认知评估系统App中使用第三方提供的软件及相关服务时，除遵守本协议及八观认知评估系统App中的其他相关规则外，还可能需要同意并遵守第三方的协议、相关规则。如因第三方软件及相关服务产生的争议、损失或损害，由您自行与第三方解决，无疆并不就此而对您或任何第三方承担任何责任。
 
 
十三. 未成年人使用条款
 
八观认知评估系统App不向未成年人提供服务。若您为未成年人用户，请您停止注册及使用八观认知评估系统App的产品或服务。 
 
十四. 其他
 
1. 本协议的成立、生效、履行、解释及争议的解决均应适用中华人民共和国法律。倘若本协议之任何规定因与中华人民共和国法律抵触而无效，则这些条款应在不违反法律的前提下按照尽可能接近本协议原条文目的之原则进行重新解释和适用，且本协议其它规定仍应具有完整的效力及效果。
 
2. 若您与无疆发生任何争议，双方应尽量友好协商解决，协商不成，您同意应将争议提交至北京仲裁委会按照其仲裁规则进行仲裁。仲裁裁决是终局的，对双方均有约束力。仲裁地点在北京市。
 
3. 为给您提供更好的服务或因国家法律法规、政策调整、技术条件、产品功能等变化需要，无疆会适时对本协议进行修订，修订内容构成本协议的组成部分。本协议更新后，无疆会在“无疆”发出更新版本，并在更新后的条款生效前通过通知、公告或其他适当的方式提醒您更新的内容，以便您及时了解本协议的最新版本，您也可以在网站首页或软件设置页面查阅最新版本的协议条款。如您继续使用八观认知评估系统App产品或服务，即表示您已同意接受修订后的本协议内容。
 
4. 如您对修订后的协议内容存有异议的，请立即停止登录或使用八观认知评估系统App产品或服务。若您继续登录或使用 八观认知评估系统App产品或服务，即视为您认可并接受修订后的协议内容。
 
5. 本协议中的标题仅为方便阅读而设，并不影响本协议中任何规定的含义或解释。
 
6. 您和无疆均是独立的主体，在任何情况下本协议不构成无疆对您的任何形式的明示或暗示担保或条件，双方之间亦不构成代理、合伙、合营或雇佣关系。

''';

const String userProtocal = '''
生效时间：2022年  02 月01 日

引言                     

北京无疆脑智科技有限公司（以下简称“无疆”或“我们”）深知个人信息（含个人敏感信息）对您的重要性，并会全力保护您的个人信息安全。我们致力于维持您对我们的信任，并将恪守以下原则，保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最小必要原则、公开透明原则、确保安全原则、主体参与原则等。同时，无疆承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。
 
本个人信息保护政策（以下简称“本政策”）仅适用于八观认知评估App提供的产品或服务。对于我们向您提供的其他产品或服务应适用其对应的个人信息保护政策。
 
在使用八观认知评估App提供的产品或服务前，请您务必仔细阅读并透彻理解本政策，并做出您认为适当的选择。本政策中与您权益（可能）存在重大关系的条款，我们已使用加粗字体予以区别，请您重点查阅。如果您不同意本政策任何内容，您应立即停止使用我们的产品或服务，我们将无法为您提供产品或服务。您使用我们的产品或服务，即意味着您已阅读并同意我们按照本政策收集、使用、储存、披露、保护您的相关信息。本政策进行更新后，我们会及时在八观认知评估App发布最新版本，以便您及时查阅。
 
 
本政策将帮助您了解以下内容：
一、适用范围及个人信息处理依据
二、我们如何收集和使用您的个人信息
三、我们如何存储您的个人信息
四、我们如何委托处理、共享、转让、公开披露您的个人信息
五、我们如何保护您的个人信息
六、您的权利
七、关于未成年人的个人信息
八、本政策如何更新
九、如何联系我们
十、争议解决
 
相关术语及定义：
1.无疆：指北京无疆脑智科技有限公司。
2. 八观认知评估App：指北京无疆脑智科技有限公司开发、运营的App。
3. 八观认知评估App产品或服务：指北京无疆脑智科技有限公司通过 八观认知评估App向您提供的产品或服务，主要包括用户认知测评任务与导出用户报告等。 
4.个人信息的处理：包括个人信息的收集、存储、使用、加工、传输、提供、公开、删除等。


一、适用范围及个人信息处理依据
1.使用范围
本政策仅适用于我们提供的八观认知评估App产品或服务时所收集的信息，不适用于我们向您提供的其他产品或服务，也不适用于通过我们的产品或服务而接入的第三方产品或服务（包括任何第三方网站）收集的信息以及通过在我们产品或服务中进行广告服务的其他公司或机构所收集的信息。

2.个人信息处理依据
除如下情形外，我们对您个人信息的处理均应取得您明确同意（包含依据有关法律、行政法规规定应当取得您的单独同意或者书面同意）：
（1）为订立、履行个人作为一方当事人的合同所必需，或者按照依法制定的劳动规章制度和依法签订的集体合同实施人力资源管理所必需；
（2）为履行法定职责或者法定义务所必需；
（3）为应对突发公共卫生事件，或者紧急情况下为保护自然人的生命健康和财产安全所必需；
（4）为公共利益实施新闻报道、舆论监督等行为，在合理的范围内处理个人信息；
（5）依照本法规定在合理的范围内处理个人自行公开或者其他已经合法公开的个人信息；
（6）法律、行政法规规定的其他情形。 

 
二、我们如何收集和使用您的个人信息

1.我们提供的基本业务功能需要依赖部分信息才得以运行。您选择使用该项业务功能，则需要向我们提供或允许我们收集的必要信息包括：
 
	•	注册。您在注册成为我们的用户的过程中，我们需要认证您身份的有效性及为了向您提供服务，为此我们将收集用户的手机号码。

	•	基本信息填写。您在登录八观认知评估App后，您需要提供您的姓名、性别、生日、学历以及历史诊断（选填），以明确您的真实身份。您若不提供前述信息，将无法使用后续认知测评等功能。

	•	进行认知能力评估。您需要按照不同认知测评项目完成对应的测评工作。您若不提供前述信息，将无法使用对应的认知能力评估。

	•	评估报告。在测评过程中，将会任务的数据信息进行搜集作为科研人员研究用图。您若不提供前述信息，科研人员将无法完成测评

请您注意，您向八观认知评估App提供用户的信息前，应当充分明确授权同意或确保已具备其他收集及提供用户个人信息的合法性基础。

（5）产品服务提供及安全保障。为了保障您使用我们产品与服务的安全性，识别账号异常状态、了解产品适配性、提供浏览、搜索等基本服务，使我们更加了解您如何接入和使用我们的服务，从而针对性地回应您的个性化需求，更好地预防欺诈、网络漏洞、计算机病毒、网络攻击、网络侵入等网络与信息安全风险，保护您、其他用户或公众人身财产安全免受侵害，我们需要采集您所使用设备的信息和日志信息。

  
2. 我们如何使用您的个人信息
 因收集您的个人信息是为了向您提供服务及提升服务质量，为了实现这一目的，除了前述内容外，我们还可能会在下列情况下使用您的个人信息：
（1）当您向无疆客服发起投诉、申诉或咨询，我们可能需要您提供真实姓名、手机号码以及时地向您反馈投诉、申诉或咨询结果，如以个人名义进行投诉，还需要提供身份证件。

  
三. 我们如何存储及保护您的个人信息
我们仅在本政策所述目的所必须期间和法律法规及监管规定的时间限内存储您的个人信息。如果我们终止服务或运营，我们将及时停止继续收集您个人信息的活动，同时会遵守相关法律法规要求提前向您通知，并终止服务或运营后对您的个人信息进行删除或匿名化处理，法律法规或监管部门另有规定的除外。
 
1. 存储地点：我们依照法律法规的规定，将您的个人信息存储于中华人民共和国境内。
2. 存储期限：除法律或相关法规另有约定外，无疆在为提供服务之目的所必需的期间内保留您的个人信息，但您要求我们立即删除或注销账户的、或法律法规另有规定的除外。
3. 超期处理方式：删除或匿名化处理。
 
四. 我们如何委托处理、共享、转让、公开披露您的个人信息
我们充分知晓因违法委托处理、共享、转让、公开披露个人信息对个人信息主体造成损害时所应承担的法律责任，我们对您的信息承担保密义务，不会出售或出租您的任何信息，对于您的个人信息的一切委托处理、共享、转让、公开披露，我们将严格按照以下条款进行：
 
1.委托处理
 为了提高效率、降低成本，我们可能会委托第三方专业服务提供商代表我们来处理信息，例如我们会聘请专业服务提供商为我们提供基础设施技术服务、云存储服务等。对我们委托处理个人信息的公司、组织和个人，我们会通过书面协议、现场审计等方式要求其遵守严格的保密义务并采取有效的保密措施，要求其只能在约定的委托范围内处理您的个人信息，而不得出于其自身利益使用您的个人信息。

2.共享
（1）共享用户的个人信息
尊重用户个人隐私是我们的一项基本原则。除以下情形外，我们不会与任何公司、组织和个人分享您的个人信息：
1）我们可能会按照司法机关或行政机关的要求，对外共享您的个人信息；
2）与合作伙伴共享：目前我们暂未向第三方共享您的个人信息，未来我们向第三方共享时，会征得您的同意，并且我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供产品和/或服务所必要的个人信息，并对我们与之共享个人信息的公司、组织和个人签署严格的保密协定，要求他们按照我们的说明、本政策以及其他任何相关的保密和安全措施来处理个人信息。
3）履行我们在本政策或我们与您达成的其他协议中的义务和行使我们的权利。
 

（2）共享用户填写的个人信息或基于使用小程序生成的信息
您使用八观认知测评后，App将生成相应的评估报告。根据您的需求，您可以在评估报告结果页面点击“分享报告”，下载图片，将图片保存。除此以外，我们不会与任何公司、组织和个人分享用户的个人信息。

 
4.转让
我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：
（1） 在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；
（2）因合并、分立、解散、被宣告破产终止合作等原因需要转移个人信息的，如涉及到个人信息转让，我们会在要求新的持有您个人信息的公司、组织继续受本政策的约束，否则我们将要求该公司、组织重新向您征求授权同意。
 
5.公开披露
我们仅会在以下情形下，公开披露您的个人信息： 
（1） 获得您明确同意后；
（2）基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的个人信息，在符合法律法规的前提下，当我们收到上述披露个人信息的请求时，我们会要求接收方必须具有与之相应的法律文件，如传票或调查函。我们坚信，对于要求我们提供的个人信息，应该在法律允许的范围内尽可能保持透明。我们对所有的请求都进行了慎重的审查，以确保其具备合法依据，且仅限于执法部门因特定调查目的且有合法权利获取的数据。
 
 
五、我们如何保护您的个人信息
我们已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。
1. 我们会对敏感个人信息（如有）采用加密方式存储。我们会使用受信赖的保护机制防止数据遭到恶意攻击。
2. 我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。
3. 我们会采取一切合理可行的措施，确保未收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。
4. 我们已制定严格的内部管理制度，以确保您的个人信息不被泄露、纂改；同时制度明确和限制，仅与此相关的必要岗位接触您的个人信息。我们会部署访问控制机制，确保只有授权人员才可访问个人信息。
5. 我们将尽力确保或担保您发送给我们的任何信息的安全性。如果我们的物理、技术、或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。
6. 互联网并非绝对安全的环境，请使用复杂密码并注意加强对您的账号信息的保护（不向第三方提供等），协助我们保证您的账号安全。一旦您泄漏了账号及其密码，您可能会丢失您的信息，并可能产生对您不利的法律后果。如您发现账号及其密码因任何原因已经或将受到泄漏时，请您立即联络我们客服，以便我们采取相应措施。但在我们知悉此种情况和在合理时间内采取行动前，我们对此不负任何责任。
7. 请您理解并明白，由于存在的各种各样的无法预知或现有技术无法防御的恶意手段，即便我们尽力采取上述措施，您的信息仍有可能被泄漏、毁损或灭失。
8. 在不幸发生个人信息安全事件后，我们将及时向您告知安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以电话、短信、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。
 
六、 您的权利
无论您何时使用我们的相关产品或服务，我们都会尽一切可能保证您可以顺利访问自己的账户信息。如果这些信息有误，我们会努力提供各种方式来让您快速更新或删除账户内信息。为了使您拥有充分的能力保障您的隐私和安全，您拥有如下权利：
1. 访问您的个人信息
您有权通过个人中心页面随时访问您的个人信息。
 
2. 更正您的个人信息
当您发现您所填写的或者我们处理的关于您的个人信息有错误时，您可以通过小程序罗列的方式自行更正。当您无法自行更正时，您可以随时联系我们的客服人员，我们将在十五天内回复您的更正请求。
 
3. 删除您的个人信息
您有权随时自行删除或者联系我们删除您的个人信息。在以下情形中，您可以向我们提出删除个人信息的请求：
（1）处理目的已实现、无法实现或者为实现处理目的不再必要；
（2）我们停止提供产品或者服务，或者保存期限已届满；
（3）您撤回同意；
（4）我们违反法律、行政法规或者违反约定处理个人信息；
（5）法律、行政法规规定的其他情形。
法律、行政法规规定的保存期限未届满，或者删除个人信息从技术上难以实现的，我们将停止除存储和采取必要的安全保护措施之外的处理。 

若我们决定响应您的删除请求，我们还将同时通知从无疆获得您的个人信息的第三方合作方，要求其及时删除，除非这些实体另行获得您的独立授权。但请知悉，若您在无疆的公开信息被其它用户或与我们没有合作、关联以及不受我们控制的独立第三方抓取、缓存、储存、复制，或通过其它用户在其它网站上传、保存时，相关信息将不受我们的控制。
 
当您从我们的服务中删除信息后，我们可能不会立即在备份系统中删除相应的信息，但会在备份更新时删除这些信息。
 
当您想删除您所填写的个人信息时，您可以通过注销账号来删除您的所有信息。当您无法自行删除时，您可以随时联系我们的客服人员，我们将在十五天内回复您的更正请求。
 
4. 改变您授权同意的范围或撤回您的授权
每个业务功能需要一些基本的个人信息才能得以完成。对于额外收集的个人信息的收集和使用，您可以随时给予或收回您的授权同意。您有权通过小程序提供的便捷操作或联系客服改变或撤回您对我们处理个人信息的同意。但您改变或撤回授权同意，不影响改变或撤回前我们基于您同意已进行的个人信息处理。我们不会以此为由拒绝提供产品的相关功能或服务，但处理个人信息属于提供产品相关功能或服务所必需的除外。
 
5． 注销账号
您可以选择注销无疆账号，但无疆有权对您提交的注销账户申请进行审核。
若您的注销账户申请被通过，我们将及时通知您，并提示您进行相关操作。请您注意，账号被注销后将不可恢复，您的个人信息将被删除或匿名化处理，建议您做好备份。
在注销账户之后，我们将停止为您提供产品或服务，并依据您的要求，删除您的个人信息，法律法规另有规定的除外。
 
 
6. 获取您的个人信息副本
我们将根据您的书面请求，为您提供以下类型的个人信息副本：您的个人基本资料、个人身份信息。您可以随时联系我们的客服人员，我们将在十五天内回复您的请求。
 
但请注意，我们为您提供的信息副本仅以我们收集的信息为限。
 
7.转移个人信息
若您请求将个人信息转移至您指定的个人信息处理者，符合国家网信部门规定条件的，我们将为您提供转移的途径。

8. 响应您的上述请求
为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。

对于您的个人信息权利请求，我们将在确认您的身份后十五天内做出答复。您可以通过本政策所载的联系方式与我们联络。对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、需要过多技术手段(例如需要开发新系统或从根本上改变现行惯例)、给他人合法权益带来风险或者非常不切实际(例如涉及备份磁带上存放的信息)的请求，我们可能会予以拒绝。
 
 
七、关于未成年的个人信息
1.小程序不向未成年人提供产品或服务。若您为未成年人，请您停止注册及使用小程序的产品或服务。 
2.请您注意，若被试者为未满十八周岁的未成年人，我们可能收集未成年人的个人信息，但我们并非用户信息的处理者，提供用户的科研人员对被试者信息有最终决定权。对此此类信息，我们将按照本政策的约定对其进行妥善保护，并依据用户的指令处理被试者者相关信息。
 
八、本政策如何更新
我们的个人信息保护政策可能变更。 
 
未经您明确同意，我们不会削减您按照本政策所应享有的权利。我们会在本页面上发布对本政策所做的任何变更。
 
对于重大变更，我们还会提供更为显著的通知（包括对于某些服务，我们会通过手机发送通知，说明个人信息保护政策的具体变更内容）。本政策所指的重大变更包括但不限于：
1. 我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等； 
2. 我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等； 
3. 个人信息共享、转让或公开披露的主要对象发生变化； 
4. 您参与个人信息处理方面的权利及其行使方式发生重大变化； 
5. 我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；
6. 个人信息安全影响评估报告表明存在高风险时。 
 
九、如何联系我们
如果您对本政策有任何疑问、意见或建议，可以通过发送邮件至ocas@wjbrain.com与我们联系。
我们将尽快审核所涉问题，并在验证您的身份后，于十五天内进行回复。
 
十、 争议解决
1. 如果您认为我们的个人信息处理行为损害了您的合法权益，您可向有关政府部门反映。
2. 本政策以及我们处理您个人信息事宜引起的争议，您可以将争议提交北京仲裁委会按照其仲裁规则进行仲裁。仲裁裁决是终局的，对双方均有约束力。仲裁地点在北京市。
''';
